Progetto di Computer Science

Simone Magnaghi, matr. 813070

In [2]:
import pandas as pd
import re
import datetime as dt
import numpy as np

Esercizio 1.

Normalize the loan_lenders table. In the normalized table, each row must have one loan_id and one lender.

In [3]:
ll=pd.read_csv('C:\\Users\\symo9\\Desktop\\FoCS\\progetto\\loans_lenders.csv')

In [4]:
#creo una lista di lenders per ogni riga
def dividi(stringa):
    return re.split(',',stringa)
ll['lista']=ll.apply(lambda row: dividi(row['lenders']), axis=1)

In [5]:
#creo una lista di lenders
lenders=[nome for lista in ll['lista'] for nome in lista]

In [6]:
#lista di lunghezze, ossia numero di lenders per ogni riga
ll['lunghezza']=[len(x) for x in ll['lista']]

In [7]:
#lista di liste, in cui ripeto l'id del loan tante volte quanti sono i lenders della riga
listone=[]
i=0
for i in range(0,len(ll)):
    listone.append([ll['loan_id'][i]]*ll['lunghezza'][i])

In [8]:
#"sciolgo" la lista precedente
loan_id=[y for x in listone for y in x]

In [9]:
#creo il dataset
lo_le=pd.DataFrame({'loan_id':loan_id, 'lenders':lenders})

In [10]:
lo_le.head(10)

   loan_id         lenders
0   483693          muc888
1   483693         sam4326
2   483693     camaran3922
3   483693     lachheb1865
4   483693     rebecca3499
5   483693   karlheinz4543
6   483693         jerrydb
7   483693       paula8951
8   483693            gmct
9   483693        amra9383

In [11]:
lo_le.tail(10)

          loan_id             lenders
28293921  1206425            rich6705
28293922  1206425         sergiiy9766
28293923  1206425          angela7509
28293924  1206425         barbara5610
28293925  1206425           david9667
28293926  1206425   trogdorfamily7622
28293927  1206425           danny6470
28293928  1206425             don6118
28293929  1206486            alan5175
28293930  1206486         amy38101311

Esercizio 2.

For each loan, add a column duration corresponding to the number of days between the disburse time and the planned expiration time. If any of those two dates is missing, also the duration must be missing.

In [12]:
l=pd.read_csv('C:\\Users\\symo9\\Desktop\\FoCS\\progetto\\loans.csv')

In [13]:
#trasformo le variabile nel formato datetime
l['planned_expiration_time']=pd.to_datetime(l['planned_expiration_time'])
l['disburse_time']=pd.to_datetime(l['disburse_time'])
#considero anche i casi in cui planned<disburse
l['duration']=abs(l['planned_expiration_time']-l['disburse_time'])
l[['loan_id','duration']].head(10)

   loan_id         duration
0   657307 53 days 19:30:06
1   657259 96 days 14:25:07
2   658010 37 days 13:10:05
3   659347 34 days 19:10:02
4   656933 57 days 22:10:02
5   659605 35 days 18:30:07
6   660240 31 days 23:50:11
7   661601 46 days 01:50:03
8   661960 33 days 16:10:03
9   662117 68 days 05:40:02

In [14]:
l[['loan_id','duration']].tail(10)

         loan_id         duration
1419597   984735 63 days 06:20:02
1419598   985764 46 days 02:40:05
1419599   986756 44 days 12:20:04
1419600   986789 40 days 11:50:04
1419601   987606 42 days 08:30:11
1419602   988180 39 days 17:00:03
1419603   988213 39 days 08:40:07
1419604   989109 51 days 14:20:04
1419605   989143 63 days 00:50:02
1419606   989240 61 days 12:50:06

Esercizio 3. 

Find the lenders that have funded at least twice.

In [15]:
#per ogni lender, conto il numero di volte in cui hanno finanziato 
lenders_twice=lo_le.groupby('lenders').count()
#considero solo i lender con almeno due finanziamenti
lenders_twice2=lenders_twice[lenders_twice['loan_id']>1]
lenders_twice2=lenders_twice2.reset_index()
lenders_twice2[['lenders']].head(10)

           lenders
0              000
1            00000
2             0002
3   0101craign0101
4          0132575
5          0154884
6          0161130
7          0169713
8          0185429
9          0206338

In [16]:
lenders_twice2[['lenders']].tail(10)

             lenders
1005101  zuzanna7983
1005102  zuzanna9818
1005103          zvi
1005104        zx147
1005105    zyrah8525
1005106       zyrorl
1005107       zzaman
1005108      zzanita
1005109     zzmcfate
1005110   zzrvmf8538

Esercizio 4.

For each country, compute how many loans have involved that country as borrowers.

In [17]:
paesi=l.groupby('country_name').size()
paesi

country_name
Afghanistan                               2337
Albania                                   3075
Armenia                                  13952
Azerbaijan                               10172
Belize                                     218
Benin                                     5946
Bhutan                                       2
Bolivia                                  25250
Bosnia and Herzegovina                     608
Botswana                                     1
Brazil                                     482
Bulgaria                                   296
Burkina Faso                              3489
Burundi                                   1727
Cambodia                                 79701
Cameroon                                  5085
Canada                                       1
Chad                                        61
Chile                                      892
China                                      134
Colombia                                 33675
Congo                                      952
Costa Rica                                4681
Cote D'Ivoire                              283
Dominican Republic                        4654
Ecuador                                  33471
Egypt                                     2460
El Salvador                              64037
Gaza                                         8
Georgia                                   6483
                                         ...
Philippines                             285336
Puerto Rico                                 80
Rwanda                                   16774
Saint Vincent and the Grenadines            16
Samoa                                    16435
Senegal                                  12107
Sierra Leone                             15576
Solomon Islands                            903
Somalia                                    227
South Africa                               633
South Sudan                               5820
Sri Lanka                                  264
Suriname                                   292
Tajikistan                               43942
Tanzania                                 16110
Thailand                                   247
The Democratic Republic of the Congo      5074
Timor-Leste                               3816
Togo                                     17106
Turkey                                    2008
Uganda                                   45882
Ukraine                                   4994
United States                             9180
Uruguay                                      1
Vanuatu                                      4
Vietnam                                  21839
Virgin Islands                               2
Yemen                                     4206
Zambia                                    1277
Zimbabwe                                  5513
Length: 96, dtype: int64

Esercizio 5.

For each country, compute the overall amount of money borrowed.

In [18]:
l.groupby('country_name')['loan_amount'].sum()

country_name
Afghanistan                              1967950.0
Albania                                  4307350.0
Armenia                                 22950475.0
Azerbaijan                              14784625.0
Belize                                    150175.0
Benin                                    3865825.0
Bhutan                                     20000.0
Bolivia                                 44226725.0
Bosnia and Herzegovina                    477250.0
Botswana                                    8000.0
Brazil                                   1192325.0
Bulgaria                                  375300.0
Burkina Faso                             4085200.0
Burundi                                  5233450.0
Cambodia                                51613525.0
Cameroon                                 2250800.0
Canada                                     50000.0
Chad                                       20075.0
Chile                                    2595925.0
China                                     380525.0
Colombia                                23613975.0
Congo                                    2265350.0
Costa Rica                               5644350.0
Cote D'Ivoire                             345300.0
Dominican Republic                       9308000.0
Ecuador                                 35519000.0
Egypt                                    1415025.0
El Salvador                             41691550.0
Gaza                                        5000.0
Georgia                                  9570425.0
                                           ...
Philippines                             97984600.0
Puerto Rico                               441900.0
Rwanda                                  29157325.0
Saint Vincent and the Grenadines           49225.0
Samoa                                   12212175.0
Senegal                                 17952175.0
Sierra Leone                            11967500.0
Solomon Islands                           815575.0
Somalia                                   308725.0
South Africa                             1006525.0
South Sudan                              2418300.0
Sri Lanka                                  74800.0
Suriname                                  748925.0
Tajikistan                              39622125.0
Tanzania                                18720300.0
Thailand                                  608925.0
The Democratic Republic of the Congo    18813425.0
Timor-Leste                              3482400.0
Togo                                    10022825.0
Turkey                                    903925.0
Uganda                                  38386500.0
Ukraine                                  7091800.0
United States                           46352000.0
Uruguay                                     8000.0
Vanuatu                                     9250.0
Vietnam                                 24681100.0
Virgin Islands                             10000.0
Yemen                                    3444000.0
Zambia                                   1978975.0
Zimbabwe                                 5851875.0
Name: loan_amount, Length: 96, dtype: float64

Esercizio 6.

Like the previous point, but expressed as a percentage of the overall amount lent.

In [19]:
stati=l.groupby('country_name')[['loan_amount']].sum()
#ammontare totale
totale=sum(stati['loan_amount'])
#percentuale
stati['loan_percentage']=(stati['loan_amount']/totale)*100
stati=stati['loan_percentage']

In [20]:
stati

country_name
Afghanistan                             0.166573
Albania                                 0.364586
Armenia                                 1.942589
Azerbaijan                              1.251410
Belize                                  0.012711
Benin                                   0.327214
Bhutan                                  0.001693
Bolivia                                 3.743468
Bosnia and Herzegovina                  0.040396
Botswana                                0.000677
Brazil                                  0.100922
Bulgaria                                0.031766
Burkina Faso                            0.345782
Burundi                                 0.442973
Cambodia                                4.368706
Cameroon                                0.190514
Canada                                  0.004232
Chad                                    0.001699
Chile                                   0.219726
China                                   0.032209
Colombia                                1.998750
Congo                                   0.191745
Costa Rica                              0.477753
Cote D'Ivoire                           0.029227
Dominican Republic                      0.787854
Ecuador                                 3.006423
Egypt                                   0.119771
El Salvador                             3.528884
Gaza                                    0.000423
Georgia                                 0.810066
                                          ...
Philippines                             8.293678
Puerto Rico                             0.037404
Rwanda                                  2.467954
Saint Vincent and the Grenadines        0.004167
Samoa                                   1.033671
Senegal                                 1.519520
Sierra Leone                            1.012961
Solomon Islands                         0.069032
Somalia                                 0.026131
South Africa                            0.085195
South Sudan                             0.204691
Sri Lanka                               0.006331
Suriname                                0.063391
Tajikistan                              3.353722
Tanzania                                1.584536
Thailand                                0.051541
The Democratic Republic of the Congo    1.592418
Timor-Leste                             0.294760
Togo                                    0.848359
Turkey                                  0.076511
Uganda                                  3.249136
Ukraine                                 0.600269
United States                           3.923357
Uruguay                                 0.000677
Vanuatu                                 0.000783
Vietnam                                 2.089074
Virgin Islands                          0.000846
Yemen                                   0.291509
Zambia                                  0.167506
Zimbabwe                                0.495318
Name: loan_percentage, Length: 96, dtype: float64

Esercizio 7.

Like the three previous points, but split for each year (with respect to disburse time).

In [21]:
#estraggo l'anno
l['year']=pd.to_datetime(l['disburse_time']).dt.year

In [22]:
paesi2=l.groupby(['year','country_name']).size()

In [23]:
#calcolo dell'ammontare totale per ogni anno
tot=l.groupby('year')[['loan_amount']].sum()

In [24]:
#per ogni anno e per ogni stato, calcolo l'ammontare dei soldi
stati2=l.groupby(['year','country_name'])[['loan_amount']].sum()
stati2=stati2.reset_index() 
#aggiungo al dataset precedente il totale per ogni anno
nuovo=pd.merge(stati2, tot, on='year')
#calcolo la percentuale, fatto 100 l'ammontare totale di ogni anno
nuovo['percentage']=(nuovo['loan_amount_x']/nuovo['loan_amount_y'])*100
nuovo=nuovo[['year','country_name','percentage']]
#come il 6
nuovo.head(10)

     year country_name  percentage
0  2005.0     Bulgaria    1.798736
1  2005.0     Cambodia    1.579971
2  2005.0      Ecuador    4.861449
3  2005.0         Gaza    4.861449
4  2005.0     Honduras   32.377248
5  2005.0        Kenya   20.758386
6  2005.0    Nicaragua    3.208556
7  2005.0      Senegal    3.135634
8  2005.0     Tanzania    2.236266
9  2005.0       Uganda   25.182304

In [25]:
nuovo.tail(10)

       year  country_name  percentage
738  2018.0          Peru    1.787834
739  2018.0   Philippines    0.030302
740  2018.0        Rwanda    2.707002
741  2018.0       Senegal    0.401505
742  2018.0  Sierra Leone    3.143860
743  2018.0      Tanzania    1.444408
744  2018.0      Thailand    2.676700
745  2018.0        Uganda    2.196914
746  2018.0       Uruguay    0.808060
747  2018.0        Zambia    1.411581

In [26]:
#come il 4
l.groupby(['year','country_name']).size()

year    country_name
2005.0  Bulgaria                               3
        Cambodia                               2
        Ecuador                               10
        Gaza                                   8
        Honduras                              72
        Kenya                                 40
        Nicaragua                              6
        Senegal                                3
        Tanzania                               5
        Uganda                                54
2006.0  Azerbaijan                            21
        Bulgaria                              70
        Cambodia                              58
        Ecuador                              253
        Ghana                                 28
        Honduras                             272
        Kenya                                434
        Mexico                               285
        Moldova                               31
        Mozambique                            16
        Nicaragua                              5
        Nigeria                              102
        Samoa                                 13
        Senegal                               54
        Tanzania                              69
        Togo                                  95
        Uganda                               366
2007.0  Afghanistan                          408
        Azerbaijan                          2133
        Bolivia                              565
                                            ...
2018.0  Costa Rica                             1
        Dominican Republic                     2
        Ghana                                 67
        Guatemala                              1
        Haiti                                 17
        India                                  1
        Indonesia                              3
        Kenya                                587
        Kyrgyzstan                             1
        Lao People's Democratic Republic      19
        Malawi                                 2
        Mali                                   1
        Mexico                                 5
        Moldova                                5
        Mozambique                            26
        Nicaragua                              7
        Nigeria                               10
        Pakistan                               6
        Panama                                 1
        Paraguay                               2
        Peru                                  10
        Philippines                            6
        Rwanda                                23
        Senegal                               10
        Sierra Leone                          19
        Tanzania                              45
        Thailand                              13
        Uganda                                 2
        Uruguay                                1
        Zambia                                14
Length: 748, dtype: int64

In [27]:
#come il 5
l.groupby(['year','country_name'])[['loan_amount']].sum()

                                         loan_amount
year   country_name
2005.0 Bulgaria                               1850.0
       Cambodia                               1625.0
       Ecuador                                5000.0
       Gaza                                   5000.0
       Honduras                              33300.0
       Kenya                                 21350.0
       Nicaragua                              3300.0
       Senegal                                3225.0
       Tanzania                               2300.0
       Uganda                                25900.0
2006.0 Azerbaijan                            15700.0
       Bulgaria                              84650.0
       Cambodia                              41950.0
       Ecuador                              151175.0
       Ghana                                 23425.0
       Honduras                              94325.0
       Kenya                                222800.0
       Mexico                               191575.0
       Moldova                               20925.0
       Mozambique                            15950.0
       Nicaragua                              3850.0
       Nigeria                               46950.0
       Samoa                                  7800.0
       Senegal                               52225.0
       Tanzania                              45200.0
       Togo                                  77600.0
       Uganda                               280475.0
2007.0 Afghanistan                          194975.0
       Azerbaijan                          1892775.0
       Bolivia                              304700.0
...                                              ...
2018.0 Costa Rica                             1550.0
       Dominican Republic                     9850.0
       Ghana                                 74675.0
       Guatemala                              3500.0
       Haiti                                 32950.0
       India                                 20000.0
       Indonesia                              3450.0
       Kenya                                393350.0
       Kyrgyzstan                             8000.0
       Lao People's Democratic Republic       6075.0
       Malawi                                 2100.0
       Mali                                  50000.0
       Mexico                                  475.0
       Moldova                               15675.0
       Mozambique                            53850.0
       Nicaragua                             13425.0
       Nigeria                               13900.0
       Pakistan                                150.0
       Panama                                30000.0
       Paraguay                                 50.0
       Peru                                  17700.0
       Philippines                             300.0
       Rwanda                                26800.0
       Senegal                                3975.0
       Sierra Leone                          31125.0
       Tanzania                              14300.0
       Thailand                              26500.0
       Uganda                                21750.0
       Uruguay                                8000.0
       Zambia                                13975.0

[748 rows x 1 columns]

Esercizio 8.

For each lender, compute the overall amount of money lent. For each loan that has more than one lender, you must assume that all lenders contributed the same amount.

In [28]:
#singolo ammontare per ogni lender
l['single_fund']=l['funded_amount']/l['num_lenders_total']

In [29]:
new=pd.merge(l, ll, on='loan_id')[['loan_id','lenders','single_fund']]

In [30]:
#associo i lenders all'ammontare che hanno prestato, ho diviso l'operazione in due perch risulta essere pi veloce
new2=pd.merge(new, lo_le, on='loan_id')[['loan_id', 'single_fund', 'lenders_y']]

In [31]:
new2.head()

   loan_id  single_fund       lenders_y
0   657307    41.666667     spencer5657
1   657307    41.666667     matthew8640
2   657307    41.666667   larry71496105
3   657259    36.363636             ltr
4   657259    36.363636      andrew5306

In [32]:
money_lent=new2.groupby('lenders_y')[['single_fund']].sum()

In [33]:
money_lent.head(10)

                 single_fund
lenders_y
 000             1485.309656
 00000           1249.127691
 0002            2201.180463
 00mike00          38.461538
 0101craign0101  2424.088932
 0132575          113.587695
 0154884          122.077677
 0161130           52.739726
 0169713           90.689866
 0185429           52.863777

In [34]:
money_lent.tail(10)

            single_fund
lenders_y
zyra9641      26.886792
zyrah8525    166.696429
zyrorl        92.599588
zzaba         25.000000
zzaman       385.071453
zzanita       62.500000
zzcyna7269    44.285714
zzinnia       32.758621
zzmcfate    1889.702578
zzrvmf8538    70.512821

Esercizio 9.

For each country, compute the difference between the overall amount of money lent and the overall amount of money borrowed. Since the country of the lender is often unknown, you can assume that the true distribution among the countries is the same as the one computed from the rows where the country is known.

In [35]:
lend=pd.read_csv('C:\\Users\\symo9\\Desktop\\FoCS\\progetto\\lenders.csv')

In [36]:
#dataset con country_code non nullo
vuoto=lend[lend['country_code'].isnull()==True]

In [37]:
#dataset con country_code nullo
pieno=lend[lend['country_code'].isnull()==False]

In [38]:
#conto il numero di volte che appare ogni stato
conteggio=pieno.groupby(['country_code']).size()

In [39]:
conteggio=conteggio.reset_index()

In [40]:
#lista completa degli stati
stati=[x for x in conteggio['country_code']]

In [41]:
#lista delle volte in cui appare ogni stato
volte=[x for x in conteggio[0]]

In [42]:
#creo una specie di urna contenente i vari stati, la cui numerosit  pari al numero di volte in cui sono apparsi nel dataset
listone2=[]
for i in range(0,len(stati)):
    listone2.append([stati[i]]*volte[i])

In [43]:
end=[y for x in listone2 for y in x]

In [44]:
#estraggo gli stati
import random
vect=[]
for i in range(0,len(vuoto)):
    vect.append(random.sample(end,1)[0])

In [45]:
#inserisco gli stati estratti nel dataset con valori mancanti
vuoto['country_code']=vect

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [46]:
new_lenders=pieno.append(vuoto)

In [47]:
new_lenders.rename(columns={'permanent_name': 'lenders_y'}, inplace=True)

In [48]:
#aggiungo al dataset dell'esercizio precedente il country_code
prestatori=pd.merge(new2, new_lenders, on='lenders_y')[['loan_id', 'lenders_y', 'country_code', 'single_fund']]

In [49]:
somma_prestati=prestatori.groupby('country_code')[['single_fund']].sum()

In [50]:
somma_ricevuti=l.groupby('country_code')[['funded_amount']].sum()

In [51]:
#metto insieme soldi ricevuti e prestati, considerando che alcuni stati hanno solo prestato, perci avranno valore nullo nella colonna dei soldi ricevuti
entrambi=pd.merge(somma_prestati, somma_ricevuti, on = 'country_code', how='left')

In [52]:
#sostituisco i valori nulli con 0
prest=[]
for i in range(0, len(entrambi)):
    if pd.isna(entrambi.iloc[i]['funded_amount'])==True:
        prest.append(0)
    else:
        prest.append(entrambi.iloc[i]['funded_amount'])
entrambi['funded_amount']=prest

In [53]:
entrambi['differenza']=entrambi['single_fund']-entrambi['funded_amount']

In [54]:
entrambi.head(10)

                single_fund  funded_amount    differenza
country_code
AD               274.107143            0.0  2.741071e+02
AE            104888.420774            0.0  1.048884e+05
AF              6078.128227      1964650.0 -1.958572e+06
AG              3922.452605            0.0  3.922453e+03
AL              1223.267139      3992475.0 -3.991252e+06
AM              1490.764159     20284675.0 -2.028318e+07
AN              1275.052580            0.0  1.275053e+03
AO              1282.990621            0.0  1.282991e+03
AQ              1579.696219            0.0  1.579696e+03
AR             49503.625974            0.0  4.950363e+04

In [55]:
entrambi.tail(10)

               single_fund  funded_amount    differenza
country_code
VG               40.000000            0.0  4.000000e+01
VI             1621.642803            0.0  1.621643e+03
VN            37170.872888     23463825.0 -2.342665e+07
VU            15286.775431         9250.0  6.036775e+03
WF              213.292196            0.0  2.132922e+02
XK              890.284318      2862325.0 -2.861435e+06
YE             6303.713659      3340025.0 -3.333721e+06
ZA            33542.774296      1006525.0 -9.729822e+05
ZM              586.518755      1913250.0 -1.912663e+06
ZW              331.459276      5818550.0 -5.818219e+06

Esercizio 10.

Which country has the highest ratio between the difference computed at the previous point and the population?

In [56]:
country_stats=pd.read_csv('C:\\Users\\symo9\\Desktop\\FoCS\\progetto\\country_stats.csv')

In [57]:
#aggiungo la differenza a country_stats
iniziale=pd.merge(country_stats, entrambi, on='country_code')[['country_code', 'population_below_poverty_line', 'population', 'differenza']]

In [58]:
primo_rapporto=iniziale
primo_rapporto['first_ratio']=primo_rapporto['differenza']/primo_rapporto['population']

In [59]:
fine_primo=primo_rapporto[['country_code', 'first_ratio']]

In [60]:
#estraggo la riga in cui first_ratio ha il valore massimo
vincitore=fine_primo.iloc[fine_primo['first_ratio'].idxmax()]

In [61]:
vincitore

country_code          LU
first_ratio     0.233957
Name: 152, dtype: object

Esercizio 11.

Which country has the highest ratio between the difference computed at point 9 and the population that is not below the poverty line?

In [62]:
secondo_rapporto=iniziale
secondo_rapporto['rich_population']=secondo_rapporto['population']-(secondo_rapporto['population_below_poverty_line']*secondo_rapporto['population']/100)

In [64]:
secondo_rapporto['second_ratio']=secondo_rapporto['differenza']/secondo_rapporto['rich_population']

In [65]:
fine_secondo=secondo_rapporto[['country_code', 'second_ratio']]

In [66]:
#estraggo la riga in cui  massimo second_ratio
vincitore2=fine_secondo.iloc[fine_secondo['second_ratio'].idxmax()]

In [67]:
vincitore2

country_code          CA
second_ratio    0.141936
Name: 71, dtype: object

Esercizio 12.

For each year, compute the total amount of loans. Each loan that has planned expiration time and disburse time in different years must have its amount distributed proportionally to the number of days in each year. For example, a loan with disburse time December 1st, 2016, planned expiration time January 30th 2018, and amount 5000USD has an amount of 5000USD * 31 / (31+365+30) = 363.85 for 2016, 5000USD * 365 / (31+365+30) = 4284.04 for 2017, and 5000USD * 30 / (31+365+30) = 352.11 for 2018.

In [86]:
l['year2']=pd.to_datetime(l['planned_expiration_time']).dt.year

In [87]:
#dataframe con record che hanno anni diversi
l1=l[(l['year2']-l['year'])>=1]
l1=l1.reset_index()
#dataframe con recordi con lo stesso anno
l2=l[(l['year2']-l['year'])==0]
l2=l2.reset_index()
#due liste: una con l'ammontare di denaro e una con gli anni
ammonti=[x for x in l2['loan_amount']]
years=[x for x in l2['year']]
#inizio a creare il dataset con i dati dei record aventi lo stesso anno 
c=pd.DataFrame({'loan':ammonti, 'anni':years})

In [88]:
lista_finale_pesi=[]
lista_finale_anni=[]

In [89]:
for i in range(0,len(l1)):
    diff=l1['year2'][i]-l1['year'][i]
    k=0
    #lista degli anni
    lista2=[]
    #lista con l'ammontare dei soldi
    lista1=[x for x in range(0,int(diff)+1)]
    for j in range(1, int(diff)):
        #lista con l'ammontare riempita con x,365,...,365,y
        lista1[j]=365
    for k in range(0,int(diff)+1):
        #appendo gli anni
        lista2.append(l1['year'][i]+k)
    #agli estremi inserisco i giorni dall'1 gennaio al giorno x e dal giorno y al 31 dicembre
    lista1[0]=365-(pd.to_datetime(l1['disburse_time'][i])).dayofyear
    lista1[-1]=(pd.to_datetime(l1['planned_expiration_time'][i])).dayofyear
    #creo una lista con i pesi per ogni anno
    pesi=[x*l1['loan_amount'][i]/sum(lista1) for x in lista1]
    for h in range(0,len(pesi)):
        #liste finali da aggiungere al dataset
        lista_finale_pesi.append(pesi[h])
        lista_finale_anni.append(lista2[h])

In [90]:
b=pd.DataFrame({'loan':lista_finale_pesi, 'anni':lista_finale_anni})

In [91]:
finale=c.append(b)

In [92]:
finale.groupby('anni')[['loan']].sum()

                loan
anni
2011.0  6.299119e+05
2012.0  1.131230e+08
2013.0  1.250890e+08
2014.0  1.531511e+08
2015.0  1.597600e+08
2016.0  1.587487e+08
2017.0  1.721008e+08
2018.0  5.705071e+06